Revit 2026 API

# SubelementGetReference Method

---

Obtains the reference to this subelement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetReference()
```
```vb
Public Function GetReference As Reference
```
```cpp
public:
Reference^ GetReference()
```
```fsharp
member GetReference : unit -> Reference
```

#### Return Value

Reference The reference to this subelement.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace